#!/usr/bin/env python
# -*- coding: utf-8 -*-
import sys
reload(sys)
sys.setdefaultencoding('utf-8')

import codecs, csv

with codecs.open("no replace earth.csv", "r+", "utf-8-sig") as file:
	russian_group_list = csv.reader(file, delimiter = ";")
	with codecs.open("earth.csv", "wb",  "utf-8-sig") as outfile:
		writer = csv.writer(outfile, delimiter = ";", quotechar='"', quoting=csv.QUOTE_ALL)
		for row in russian_group_list:
			if row[4].find("3к") is not -1:
				row[4] = row[4].replace("3к", "3")
			elif row[4].find("4к") is not -1:
				row[4] = row[4].replace("4к", "4")
			elif row[4].find("2к") is not -1:
				row[4] = row[4].replace("2к", "2")
			elif row[4].find("1к") is not -1:
				row[4] = row[4].replace("1к", "")
			elif row[4].find("1м") is not -1:
				row[4] = row[4].replace("1м", "1")
			elif row[4].find("1М") is not -1:
				row[4] = row[4].replace("1М", "1")
			elif row[4].find("2м") is not -1:
				row[4] = row[4].replace("2м", "2")
			if row[4].find("Страноведение и международный туризм") is not -1:
				row[4] = row[4].replace("4 Страноведение и международный туризм", "Страноведение и международный туризм")
				row[4] = row[4].replace("3", "")
			if row[4].find("Метеорология и климатология") is not -1:
				row[4] = row[4].replace("4 Метеорология и климатология", "Метеорология и климатология")
				row[4] = row[4].replace("3", "")
			if row[4].find("Региональная политика и территориальное планирование") is not -1:
				row[4] = row[4].replace("4 Региональная политика и территориальное планирование", "Региональная политика и территориальное планирование")
				row[4] = row[4].replace("3 Региональная политика и территориальное планирование", "Региональная политика и территориальное планирование")
			if row[4].find("Экономическая и социальная география") is not -1:
				row[4] = row[4].replace("4 Экономическая и социальная география", "Экономическая и социальная география")
				row[4] = row[4].replace("3 Экономическая и социальная география", "Экономическая и социальная география")
			if row[4].find("Экологическая безопасность") is not -1:
				row[4] = row[4].replace("4 Экологическая безопасность", "Экологическая безопасность")
				row[4] = row[4].replace("3 Экологическая безопасность", "Экологическая безопасность")
			if row[4].find("География полярных стран") is not -1:
				row[4] = row[4].replace("4 Экологическая безопасность", "Экологическая безопасность")
				row[4] = row[4].replace("3 Экологическая безопасность", "Экологическая безопасность")
			if row[4].find("Геоинформатика") is not -1:
				row[4] = row[4].replace("4 Геоинформатика", "Геоинформатика")
				row[4] = row[4].replace("3 Геоинформатика", "Геоинформатика")
				row[4] = row[4].replace("2 Геоинформатика", "Геоинформатика")
			if row[4].find("Биогеография и география почв") is not -1:
				row[4] = row[4].replace("4 Биогеография и география почв", "Биогеография и география почв")
				row[4] = row[4].replace("3 Биогеография и география почв", "Биогеография и география почв")
				row[4] = row[4].replace("2 Биогеография и география почв", "Биогеография и география почв")
			if row[4].find("Гидрология") is not -1:
				row[4] = row[4].replace("4 Биогеография и география почв", "Биогеография и география почв")
				row[4] = row[4].replace("3 Биогеография и география почв", "Биогеография и география почв")
			if row[4].find("География полярных стран") is not -1:
				row[4] = row[4].replace("4 География полярных стран", "География полярных стран")
				row[4] = row[4].replace("3 География полярных стран", "География полярных стран")
				row[4] = row[4].replace("2 География полярных стран", "География полярных стран")
			if row[4].find("Океанология") is not -1:
				row[4] = row[4].replace("4 Океанология", "Океанология")
			if row[4].find("Гидрология") is not -1:
				row[4] = row[4].replace("4 Гидрология", "Гидрология")
				row[4] = row[4].replace("3 Гидрология", "Гидрология")
			if row[4].find("Технология и организация туроператорских и турагентских услуг") is not -1:
				row[4] = row[4].replace("4 Технология и организация туроператорских и турагентских услуг", "Технология и организация туроператорских и турагентских услуг")
				row[4] = row[4].replace("3 Технология и организация туроператорских и турагентских услуг", "Технология и организация туроператорских и турагентских услуг")
				row[4] = row[4].replace("2 Технология и организация туроператорских и турагентских услуг", "Технология и организация туроператорских и турагентских услуг")
			if row[4].find("Геоэкология") is not -1:
				row[4] = row[4].replace("4 Геоэкология", "Геоэкология")
				row[4] = row[4].replace("4  Геоэкология", "Геоэкология")
				row[4] = row[4].replace("3 Геоэкология", "Геоэкология")
			if row[4].find("Ландшафтное планирование") is not -1:
				row[4] = row[4].replace("4 Ландшафтное планирование", "Ландшафтное планирование")
				row[4] = row[4].replace("3 Ландшафтное планирование", "Ландшафтное планирование")
			if row[4].find("Политическая география и геополитика") is not -1:
				row[4] = row[4].replace("4 Политическая география и геополитика", "Политическая география и геополитика")
			if row[4].find("Землеустройство и кадастры") is not -1:
				row[4] = row[4].replace("4 Землеустройство и кадастры", "Землеустройство и кадастры")
			if row[4].find("Физическая и эволюционная география") is not -1:
				row[4] = row[4].replace("4 Физическая и эволюционная география", "Физическая и эволюционная география")
			if row[4].find("Природопользование") is not -1:
				row[4] = row[4].replace("4 Природопользование", "Природопользование")
			if row[4].find("Геоморфология и палеогеография") is not -1:
				row[4] = row[4].replace("4 Геоморфология и палеогеография", "Геоморфология и палеогеография")
			if row[4].find("1М  Почвоведение") is not -1:
				row[4] = row[4].replace("1М  Почвоведение", "1  Почвоведение")
			if row[4].find("2 Нефтегазовое дело") is not -1:
				row[4] = row[4].replace("2 Нефтегазовое дело", "2  Нефтегазовое дело")
			writer.writerow(row)